Revit 2026 API

# StairsLandingCreateSketchedLandingWithSlopeData Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static StairsLanding CreateSketchedLandingWithSlopeData(
	Document document,
	ElementId stairsId,
	IList<SketchedStairsCurveData> curveLoop,
	double baseElevation
)
```
```vb
Public Shared Function CreateSketchedLandingWithSlopeData (
	document As Document,
	stairsId As ElementId,
	curveLoop As IList(Of SketchedStairsCurveData),
	baseElevation As Double
) As StairsLanding
```
```cpp
public:
static StairsLanding^ CreateSketchedLandingWithSlopeData(
	Document^ document,
	ElementId^ stairsId,
	IList<SketchedStairsCurveData^>^ curveLoop,
	double baseElevation
)
```
```fsharp
static member CreateSketchedLandingWithSlopeData :
        document : Document *
        stairsId : ElementId *
        curveLoop : IList<SketchedStairsCurveData> *
        baseElevation : float -> StairsLanding
```

#### Parameters

document Document

stairsId ElementId

curveLoop IListSketchedStairsCurveData

baseElevation Double

#### Return Value

StairsLanding

#### Reference

StairsLanding Class

Autodesk.Revit.DB.Architecture Namespace